app/controllers/api/robots_controller.rb

  def create
    robots_body = JSON.parse(request.body.read)

    if robots_body.is_a?(Array)
      robots_body.each do |robot_params|
        robot = Robot.new(robot_params)
        if robot.save
---
INSERT INTO "robots" ("name", "created_at", "updated_at", "robot_type_id") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "Robot A"], ["created_at", "2024-05-02 14:05:48.527518"], ["updated_at", "2024-05-02 14:05:48.527518"], ["robot_type_id", 1]]