app/views/tasks/edit.html.erb

  <%= form.label :robot_type_id, "Robot Type" %>
  <%= form.collection_select :robot_type_id,
                         RobotType.all,
                         :id,
                         :name,
                         { include_blank: true } %>
---
SELECT "robot_types".* FROM "robot_types"

  <%= form.label :robot_id, "Assign to Robot" %>
  <%= form.collection_select :robot_id, Robot.all, :id, :name, { include_blank: true } %>
---
SELECT "robots".* FROM "robots"