app/views/tasks/index.html.erb

SELECT "robots".* FROM "robots" WHERE "robots"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <td>
          <% if task.robot.present? %>