app/views/tasks/new.html.erb

SELECT "robot_types".* FROM "robot_types"
---
  <%= form.label :robot_type_id, "Robot Type" %>
  <%= form.collection_select :robot_type_id,
                         RobotType.all,
                         :id,
                         :name,
                         { include_blank: true } %>