app/views/robots/edit.html.erb

SELECT "robot_types".* FROM "robot_types"
---
  <%= form.label :robot_type_id, "Robot Type" %>
  <%= form.collection_select :robot_type_id, RobotType.all, :id, :name %>