app/views/robots/show.html.erb


<% if @robot.tasks.any? %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."robot_id" = ?  [["robot_id", 1]]
SELECT 1 AS one FROM "tasks" WHERE "tasks"."robot_id" = ? LIMIT ?  [["robot_id", 3], ["LIMIT", 1]]

    <tbody>
      <% @robot.tasks.each do |task| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."robot_id" = ?  [["robot_id", 5]]