app/controllers/robots_controller.rb

  def index
    @robots = Robot.all
---
SELECT "robots".* FROM "robots"

  def create
    @robot = Robot.new(robot_params)
    if @robot.save
---
INSERT INTO "robots" ("name", "robot_type", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "Frank2"], ["robot_type", "Quadrupedal"], ["created_at", "2024-05-01 15:04:16.257363"], ["updated_at", "2024-05-01 15:04:16.257363"]]

  def show
    @robot = Robot.find(params[:id])
---
SELECT "robots".* FROM "robots" WHERE "robots"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @robot = Robot.find(params[:id])
---
SELECT "robots".* FROM "robots" WHERE "robots"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def destroy
    @robot = Robot.find(params[:id])
    @robot.destroy
---
SELECT "robots".* FROM "robots" WHERE "robots"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "robots" WHERE "robots"."id" = ?  [["id", 2]]