app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."completed" = ?  [["completed", 0]]
---
  def index
    @tasks = Task.where(completed: false)

INSERT INTO "tasks" ("description", "eta", "completed", "robot_id", "created_at", "updated_at", "robot_type_id") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["description", "Testing"], ["eta", 21], ["completed", 0], ["robot_id", nil], ["created_at", "2024-05-02 12:35:05.778779"], ["updated_at", "2024-05-02 12:35:05.778779"], ["robot_type_id", 2]]
---
  def create
    @task = Task.new(task_params)

    if @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "tasks" SET "updated_at" = ?, "robot_type_id" = ? WHERE "tasks"."id" = ?  [["updated_at", "2024-05-02 14:35:04.043178"], ["robot_type_id", 3], ["id", 13]]
---
  def update
    @task = Task.find(params[:id])

    if @task.update(task_params)

SELECT "robots".* FROM "robots" WHERE "robots"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."robot_id" IS NULL LIMIT ?  [["LIMIT", 5]]
SELECT 1 AS one FROM "tasks" WHERE "tasks"."robot_id" IS NULL LIMIT ?  [["LIMIT", 1]]
UPDATE "tasks" SET "robot_id" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["robot_id", 1], ["updated_at", "2024-05-02 17:06:46.483221"], ["id", 1]]
---
  def assign_tasks
    @robot = Robot.find(params[:id])
    unassigned_tasks = Task.where(robot_id: nil).limit(5)
    if unassigned_tasks.empty?
      flash[:notice] = "No unassigned tasks available"
    else
      unassigned_tasks.each do |task|
        task.update(robot: @robot)  # Assign task to the robot

SELECT "robots".* FROM "robots" WHERE "robots"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."robot_id" = ? AND "tasks"."completed" = ?  [["robot_id", 1], ["completed", 0]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."robot_id" = ? AND "tasks"."completed" = ?  [["robot_id", 5], ["completed", 0]]
UPDATE "tasks" SET "completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed", 1], ["updated_at", "2024-05-02 17:09:00.817396"], ["id", 1]]
---
  def complete_tasks
    @robot = Robot.find(params[:id])
    tasks_to_complete = @robot.tasks.where(completed: false)

    tasks_to_complete.each do |task|
      if @robot.can_perform_task?(task)
        eta_ms = task.eta || 0
        # sleep(eta_ms/1000)
        sleep(eta_ms / 100000) # NOTE: using 100000 for quicker responses
        flash[:notice] = "Working on task " + task.description
        task.update(completed: true)