app/controllers/tasks_controller.rb

SELECT "robots".* FROM "robots" WHERE "robots"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "tasks" WHERE "tasks"."robot_id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."robot_id" IS NULL LIMIT ?  [["LIMIT", 5]]
---
  def assign_tasks
    @robot = Robot.find(params[:id])
    unassigned_tasks = Task.where(robot_id: nil).limit(5)
    if unassigned_tasks.empty?
      flash[:notice] = "No unassigned tasks available"
    else
      unassigned_tasks.each do |task|

SELECT "robots".* FROM "robots" WHERE "robots"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."robot_id" = ? AND "tasks"."completed" = ?  [["robot_id", 1], ["completed", 0]]
---
  def complete_tasks
    @robot = Robot.find(params[:id])
    tasks_to_complete = @robot.tasks.where(completed: false)

    tasks_to_complete.each do |task|